Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-26-37.tmx
Source language: bo
Languages: en

source: །སེམས་ཅན་ཚད་མེད་པ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལམ་རྣམ་པར་དག་པ་ལ་རབ་ཏུ་བཀོད་དོ།
en: Countless beings were established on the pure path of the perfections.

source: །སེམས་ཅན་ཚད་མེད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ས་དང་པོ་ལ་རབ་ཏུ་བཀོད་དོ། །སེམས་ཅན་ཚད་མེད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ས་གཉིས་པ་དང་། གསུམ་པ་དང་བཞི་པ་དང་ལྔ་པ་དང་། དྲུག་པ་དང་བདུན་པ་དང་། བརྒྱད་པ་དང་དགུ་པ་ལ་རབ་ཏུ་བཀོད་དོ།
en: Countless beings were established on the first bodhisattva bhūmi. Countless beings were established on the second, third, fourth, fifth, sixth, seventh, eighth, and ninth bodhisattva bhūmis.

source: །སེམས་ཅན་ཚད་མེད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ས་བཅུ་པ་ལ་རབ་ཏུ་བཀོད་དོ།
en: Countless beings were established on the tenth bhūmi.

source: །སེམས་ཅན་ཚད་མེད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྨོན་ལམ་གྱི་ཁྱད་པར་ཅན་ལ་བཙུད་དོ།
en: Countless beings were brought into the preeminent conduct and prayers of the bodhisattvas.

source: །སེམས་ཅན་ཚད་མེད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དང་། སྨོན་ལམ་རྣམ་པར་དག་པ་ལ་རབ་ཏུ་བཀོད་དོ།
en: Countless beings were established in the completely good conduct and prayers of the bodhisattvas.

source: །དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་དེས་སངས་རྒྱས་ཀྱི་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་དང་། རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་པས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བས་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་སེམས་ཅན་གྱི་ཁམས་མཐའ་དང་དབུས་མེད་པ་རྣམ་པར་དུལ་བར་གྱུར་ཏོ།
en: “In that way, the Tathāgata turned the wheel of the Dharma through the inconceivable miraculous manifestations and the power of the preeminence of a buddha, so that in each instant of mind he guided realms of beings without end or center.

source: །འཇིག་རྟེན་གྱི་ཁམས་དེའི་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཀྱང་དེ་བཞིན་གཤེགས་པ་དེའི་སྐུ་སྣ་ཚོགས་དང་། ཐབས་མཁས་པ་སྣ་ཚོགས་ཀྱིས་བསྒྲུབས་པའི་ཆོས་བསྟན་པ་ཡོངས་སུ་ཤེས་པར་གྱུར་ཏེ།
en: “All the beings of that world realm understood the Dharma taught by that tathāgata through various bodies and the accomplishment of various skillful methods.

source: རྒྱལ་པོའི་ཕོ་བྲང་རིན་པོ་ཆེའི་མེ་ཏོག་སྒྲོན་མའི་སེམས་ཅན་གཟུགས་དང་། ཁ་དོག་དང་ཡུལ་དང་ལོངས་སྤྱོད་ཀྱིས་རྒྱགས་ཤིང་དྲེགས་ཏེ་གཅིག་ལ་གཅིག་ཁྱད་དུ་གསོད་པ་དེ་རྣམས་གདུལ་བའི་དོན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་དུ་བཟང་པོས་ཁ་དོག་དང་གཟུགས་མཆོག་ཏུ་ཕྱིན་པར་མངོན་པར་སྤྲུལ་ཏེ། རྒྱལ་པོའི་ཕོ་བྲང་དེར་ཕྱིན་ཏོ།
en: “In order to guide those beings in the royal capital Ratna­kusuma­pradīpā, who were proud and arrogant because of their form, color, scope, and enjoyments and had no care for one another, the bodhisattva Samanta­bhadra manifested a supreme color and form and went to the royal capital.

source: །དེའི་འོད་ཤིན་ཏུ་ཡངས་པས་རྒྱལ་པོའི་གནས་དེ་དག་ཐམས་ཅད་དུ་ཡོངས་སུ་སྣང་བར་གྱུར་ཏེ།
en: His halo was so vast that it illuminated the entire royal capital.

source: རྒྱལ་པོའི་གནས་དེའི་འོད་དང་། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་རྣམ་པར་སྣང་བ་རིན་ཆེན་པདྨོའི་དཔལ་གྱི་གཙུག་ཕུད་སྙིང་པོའི་ལུས་ལས་བྱུང་བའི་འོད་དང་། བུད་མེད་རིན་པོ་ཆེའི་འོད་དང་། རིན་པོ་ཆེའི་ཤིང་གི་འོད་དང་། ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོའི་འོད་དང་། གཉི་ཟླ་དང་གཟའ་སྐར་དང་རྒྱུ་སྐར་གྱི་འོད་དང་། འཛམ་བུའི་གླིང་ན་འོད་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་མི་སྣང་བར་གྱུར་ཏེ།
en: “The light of the royal capital, the light from the body of the cakravartin king Vairocana­ratna­padma­garbha­śrī­cūḍa , the light from the precious queen, the light from the precious trees, the light from the precious jewels, the light from the sun, moon, planets, and stars, and whatever lights there were in Jambudvīpa all ceased to shine.

source: དཔེར་ན་ཉི་མ་ཤར་ཏེ་མུན་པ་དང་། ཟླ་བ་དང་གཟའ་སྐར་དང་། རྒྱུ་སྐར་གྱི་འོད་ཀྱང་མི་སྣང་ལ་མེ་དང་ནོར་བུའི་འོད་ཀྱང་མི་སྣང་ངོ་།
en: “For example, when the sun shines, darkness and the light of the moon, planets, stars, and constellations vanish, and the light from fire and jewels vanishes.

source: །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་དུ་བཟང་པོས་ཟིལ་གྱིས་ནོན་ནས་འཛམ་བུའི་གླིང་དེ་ན་འོད་ཡོད་པ་ཐམས་ཅད་ཀྱང་མི་སྣང་བར་གྱུར་ཏོ།
en: In the same way, through being outshined by the bodhisattva Samanta­bhadra, all the lights in Jambudvīpa vanished.

source: །འདི་ལྟ་སྟེ་དཔེར་ན། འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་ས་ལེ་སྦྲམ་གྱི་དྲུང་དུ་སྣག་ཚའི་གཟུགས་བཞག་ན་མཛེས་པར་མི་རུང་། ལྷ་གེར་མི་རུང་། ལྷ་མེར་མི་རུང་། ལྷ་དེར་མི་རུང་ངོ་།
en: “It is just as if, for example, you were to place some lampblack in front of a lump of Jambu River gold, it would not be beautiful, would not be bright, would not glow, and would not shine.

source: །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་དུ་བཟང་པོའི་མདུན་དུ་སེམས་ཅན་དེ་དག་གི་གཟུགས་ཀྱི་ལུས་ཀྱང་མཛེས་པར་མ་རུང་། ལྷ་གེར་མ་རུང་། ལྷ་མེར་མ་རུང་། ལྷ་དེར་མ་རུང་ངོ་། །དེ་ནས་དེ་དག་འདི་སྙམ་དུ་གྱུར་ཏེ།
en: In the same way, when the physical forms of those beings were in front of the bodhisattva Samanta­bhadra, they were not beautiful, were not bright, were not glowing, and were not shining.

source: དེ་ལྟ་བུ་ཞིག་དེ་ལྟར་དེའི་དྲུང་དུ་བདག་ཅག་གི་ལུས་སམ། འོད་དམ་ཁ་དོག་གམ། གཟི་བརྗིད་ཀྱིས་ཀྱང་མཛེས་པར་མ་རུང་། ལྷ་གེར་མ་རུང་། ལྷ་མེར་མ་རུང་།
en: “They thought, ‘In front of him our bodies, light, color, and brilliance are not beautiful, not bright, not glowing, and they do not shine.

source: ལྷ་དེར་མ་རུང་བ་དེ་ལྟ་ལྷའམ། ཚངས་པའམ། ཅི་ཞིག་དེའི་མཚན་མ་ནི་གཟུང་བར་མི་ནུས་སོ་སྙམ་མོ།
en: Is this a deva or Brahmā whose attributes we are unable to comprehend?’

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོས་རྒྱལ་པོའི་གནས་རིན་པོ་ཆེའི་མེ་ཏོག་སྒྲོན་མའི་དབུས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་རྣམ་པར་སྣང་བ་རིན་ཆེན་པདྨོ་དཔལ་གྱི་གཙུག་ཕུད་སྙིང་པོའི་གཞལ་མེད་ཁང་གི་སྟེང་གི་བར་སྣང་ལ་འདུག་སྟེ། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་རྣམ་པར་སྣང་བ་རིན་ཆེན་པདྨོ་དཔལ་གྱི་གཙུག་ཕུད་སྙིང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “Then the bodhisattva Samanta­bhadra stood in the sky above the aerial palace of the cakravartin king Vairocana­ratna­padma­garbha­śrī­cūḍa , which was in the center of the royal capital Ratna­kusuma­pradīpā.

source: །རྒྱལ་པོ་ཆེན་པོ་ཤེས་པར་གྱིས་ཤིག །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: He said to the cakravartin king Vairocana­ratna­padma­garbha­śrī­cūḍa , ‘Great king, know this! A tathāgata arhat samyak­saṃbuddha has appeared in this world. He is dwelling in your land, at the bodhimaṇḍa called Samantāvabhāsana­dharma­megha­nirghoṣa­dhvaja.’

source: ཁྱོད་ཀྱི་ཁམས་འདི་ཉིད་ཀྱི་སྙིང་པོ་བྱང་ཆུབ་ཆོས་ཀུན་ཏུ་སྣང་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་སྒྲ་དབྱངས་རྒྱལ་མཚན་འདི་ཉིད་ན་རྣམ་པར་སྤྱོད་དོ་ཞེས་པ་དང་། རྒྱལ་པོའི་བུ་མོ་ཡེ་ཤེས་ཀྱི་འོད་ཀུན་ཏུ་འཕྲོ་བ་པདྨོ་བཟང་པོ་མིག་ཡིད་དུ་འོང་བའི་དཔལ་གྱི་ཟླ་བས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་དུ་བཟང་པོའི་གཟུགས་ཀྱི་ལུས་དང་། འོད་དང་རྣམ་པར་འཕྲུལ་པ་དང་རྒྱན་མཐོང་སྟེ། དབྱངས་ཐོས་ནས་དགའ་བ་དང་། མོས་པའི་ཤུགས་ཆེན་པོ་སྐྱེས་ཏེ།
en: “When the king’s daughter, Samanta­jñānārci­padma­bhadrābhirāma­netra­śrī­candrā, saw the bodhisattva Samanta­bhadra’s body, light, miracles, and adornments and heard his voice, she experienced a powerful happiness and delight.

source: དེའི་ཚེ་སེམས་འདི་སྙམ་དུ་བསྐྱེད་དོ།
en: “At that time, she thought, ‘May I, through whatever roots of merit I accumulate, attain a body like that!

source: །བདག་གིས་དགེ་བའི་རྩ་བ་གང་ཅི་བསྩགས་པ་དེས་བདག་ཀྱང་ལུས་འདི་འདྲ་བར་ཐོབ་པར་ཤོག་ཤིག །རྒྱན་འདི་འདྲ་བ་དང་། མཚན་འདི་འདྲ་བ་དང་། སྤྱོད་ལམ་འདི་འདྲ་བ་དང་། རྫུ་འཕྲུལ་འདི་འདྲ་བར་ཤོག་ཤིག །ཇི་ལྟར་འདིས་མཚན་མོ་མུན་ནག་གི་ནང་ན་སེམས་ཅན་རྣམས་ལ་སྣང་བ་ཆེན་པོ་བསྐྱེད་དེ། སངས་རྒྱས་སྐྱེ་བ་ཡོངས་སུ་བརྗོད་པ་དེ་བཞིན་དུ།
en: May I have that kind of jewelry, those kinds of characteristics, that kind of conduct, and those kinds of miraculous powers! Just as he has brought a great light for beings in the darkness of night and told them of the birth of a buddha, so may I dispel the darkness of ignorance in beings and bring them the light of great wisdom!

source: བདག་གིས་ཀྱང་སེམས་ཅན་རྣམས་ཀྱི་མི་ཤེས་པའི་མུན་པ་བསྩལ་ཏེ་ཡེ་ཤེས་ཆེན་པོ་འདི་སྣང་བསྐྱེད་པར་བྱའོ། །གང་དང་གང་དུ་སྐྱེས་པ་ཐམས་ཅད་དུའང་དགེ་བའི་བཤེས་གཉེན་འདི་དང་མི་འབྲལ་བར་ཤོག་ཤིག །དེ་ནས་རིགས་ཀྱི་བུ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་རྣམ་པར་སྣང་བ་རིན་ཆེན་པདྨོ་དཔལ་གྱི་གཙུག་ཕུད་སྙིང་པོ་ཡན་ལག་བཞིའི་དཔུང་གི་ཚོགས་དང་ལྷན་ཅིག །རིན་པོ་ཆེ་བདུན་དང་ལྷན་ཅིག །བུད་མེད་ཀྱི་ཚོགས་ཀྱི་འཁོར་དང་ལྷན་ཅིག་བུ་དང་བློན་པོ་དང་། ལྗོངས་ཀྱི་མི་དང་ལྷན་ཅིག་ཏུ་རྒྱལ་པོའི་རྫུ་འཕྲུལ་ཆེན་པོ་དང་། རྒྱལ་པོའི་མཐུ་ཆེན་པོས་རྒྱལ་པོའི་གནས་རིན་པོ་ཆེའི་མེ་ཏོག་སྒྲོན་མ་དེ་ནས་འཕགས་ཏེ་གྱེན་ཏུ་ནམ་མཁའ་ལ་དཔག་ཚད་གཅིག་ཙམ་དུ་མངོན་པར་འཕགས་ནས།
en: Wherever I am reborn, may I never in all those lives be separated from this kalyāṇamitra!’ “Then, noble one, the cakravartin king Vairocana­ratna­padma­garbha­śrī­cūḍa , with the four divisions of his army, with his seven jewels, with his retinue of women, and with his ministers and the people of his land, through the king’s miraculous powers, through the great might of the king, rose up into the sky above the royal capital Ratna­kusuma­pradīpā to a height of one yojana.

source: འཛམ་བུའི་གླིང་ཐམས་ཅད་དང་། གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་སྣང་བ་ཆེན་པོས་རྒྱས་པར་བཀང་སྟེ།
en: He filled the whole of Jambudvīpa and the entire four-continent world with a great light.

source: སེམས་ཅན་ཐམས་ཅད་སངས་རྒྱས་བལྟ་བ་ལ་ཡོངས་སུ་བསྐུལ་བའི་དོན་དུ་རིན་པོ་ཆེའི་རི་ཐམས་ཅད་ལ་གཟུགས་བརྙན་མངོན་པར་བསྟན་ཅིང་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་གཏོགས་པའི་སེམས་ཅན་རྣམས་ལ་མངོན་སུམ་དུ་གནས་ཏེ་སངས་རྒྱས་ལ་བལྟ་བ་དེ་ཚིགས་སུ་བཅད་དེ་གླུའི་དབྱངས་ཀྱིས་བསྔགས་པ།
en: In order to encourage all beings to come and see the Buddha, he manifested his image on all the precious mountains and became present before all beings in the four-continent world realm and sang a song of verses that praised seeing the Buddha: “ ‘Into the world has come a buddha

source: །ལུས་ཅན་ཐམས་ཅད་སྐྱབས་མཛད་པའི།
en: Who will be a savior for all who have bodies.

source: །སངས་རྒྱས་འཇིག་རྟེན་བྱུང་བར་གྱུར།
en: Everyone should rise and set forth

source: །འཇིག་རྟེན་གཙོ་བོ་དེ་བལྟ་བར།
en: In order to see that lord of the world!

source: །ཀུན་ཀྱང་ལངས་ཏེ་འདོང་བར་གྱིས།
en: ‘The appearance of a tathāgata,

source: །ལུས་ཅན་ཀུན་ལ་ཕན་དོན་དུ། །ཆོས་རབ་སྟོན་པར་གང་མཛད་པའི།
en: Someone who teaches the Dharma In order to benefit all who have bodies,

source: །དེ་བཞིན་གཤེགས་པ་འབྱུང་བ་ནི། །བསྐལ་པ་བྱེ་བའི་བརྒྱ་ལམ་ནའོ།
en: May occur only once in a billion kalpas. “ ‘He developed compassion on seeing

source: །འཇིག་རྟེན་ཕྱིན་ཅིར་ལོག་གྱུར་ཅིང་།
en: The world having gone astray,

source: །མི་ཤེས་སྒྲིབ་པས་བསྒྲིབས་གྱུར་ཏེ།
en: Obscured by the darkness of ignorance

source: །འཁོར་བའི་སྡུག་བསྔལ་མྱོང་པ་རྣམས།
en: And experiencing the suffering of saṃsāra.

source: །གཟིགས་ཤིང་ཐུགས་རྗེ་ཆེ་བསྐྱེད་ནས།
en: ‘In order to ripen beings

source: །སྡུག་བསྔལ་ཐམས་ཅད་གཞིལ་དོན་དུ། །སེམས་ཅན་ཡོངས་སུ་སྨིན་བྱའི་ཕྱིར།
en: So as to extinguish all suffering, He practiced enlightened conduct

source: །བསྐལ་པ་བྱེ་བ་གྲངས་མེད་དུ། །བྱང་ཆུབ་སྤྱོད་པ་སྤྱད་པ་མཛད།
en: For countless millions of kalpas.

source: བསྐལ་པ་མཐའ་ཡས་མུ་མེད་པར།
en: ‘For limitless, endless kalpas,

source: །སངས་རྒྱས་བྱང་ཆུབ་མཆོག་དོན་དུ།
en: For the sake of the supreme enlightenment of buddhahood,

source: །ཞབས་དང་ཕྱག་ཀྱང་ཡོངས་སུ་བཏང་།
en: He gave away his legs and his arms,

source: །སྤྱན་དང་སྙན་དང་དབུ་ཡང་བཏང་།
en: And he also gave away his eyes, ears, and head.

source: །མཐོང་ཞིང་བསྙེན་བཀུར་བྱས་པ་དང་། །ཐོས་པ་དོན་ཡོད་འགྱུར་བ་ཡིན།
en: ‘To see him, honor him, And hear him will be beneficial. It is rare even in ten million kalpas

source: །འཇིག་རྟེན་མགོན་པོ་འཇིག་རྟེན་དུ། །འབྱུང་བ་བསྐལ་པ་བྱེ་བར་དཀོན།
en: For a lord of the world to appear in the world.

source: དེ་ནི་བྱང་ཆུབ་གདན་ལ་བཞུགས།
en: ‘He is dwelling at the seat of enlightenment.

source: །གསུང་བའི་དམ་པ་བལྟར་ཡང་ཡོད།
en: He is there like a supreme secret.

source: །བདུད་རྣམས་སྡེ་དང་བཅས་བཏུལ་ཏེ།
en: He has subjugated Māra and his armies

source: །བྱང་ཆུབ་མཆོག་ཏུ་རྣམ་སངས་རྒྱས།
en: And attained the supreme enlightenment of buddhahood.

source: །འོད་གཟེར་དཀྱིལ་འཁོར་མཐའ་ཡས་པ།
en: ‘There is an infinite aura of light

source: །སངས་རྒྱས་སྐུ་ལས་མངོན་བཀྱེ་ཞིང་།
en: That radiates from the Buddha’s body.

source: །འགྲོ་བ་ཚིམ་པར་མཛད་པ་ཡི། །ཁ་དོག་སྣ་ཚོགས་འདི་ལ་ལྟོས།
en: Come see its various colors That bring satisfaction to beings.

source: །འོད་ཟེར་སྤྲིན་མང་གྲངས་མེད་པ།
en: ‘There are countless clouds of light rays

source: །སངས་རྒྱས་སྐུ་ལས་འཐོན་པ་རྣམས།
en: That come from the Buddha’s body.

source: །དེས་ནི་སེམས་ཅན་སྣང་གྱུར་ན།
en: Those beings upon whom they shine

source: །བདེ་བ་དཔེ་མེད་འཐོབ་པར་འགྱུར།
en: Attain an unparalleled happiness.

source: །བརྩོན་འགྲུས་ཆེན་པོ་རབ་རྩོམ་སྟེ།
en: ‘Develop great diligence.

source: །རང་དང་རང་གི་བསམ་པ་ཡིས།
en: And each according to your wishes,

source: །མགོན་པོ་དེ་ལ་མཆོད་པ་གྱིས།
en: Make offerings to that protector.

source: །ཚུར་ཤེག་དེ་ཡི་གན་དུ་འདོང་།
en: And go into his presence!’

source: །དེ་ནས་རྒྱལ་པོ་རྣམ་པར་སྣང་བ་རིན་ཆེན་པདྨོ་དཔལ་གྱི་གཙུག་ཕུད་སྙིང་པོས་ཚིགས་སུ་བཅད་པ་དེ་དག་གིས་བདག་གི་ཁམས་ན་གནས་པའི་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྐུལ་ཏེ།
en: “After King Vairocana­ratna­padma­garbha­śrī­cūḍa had thus encouraged all the beings in his realm with those verses, the cakravartin’s roots of merit created a rain of a million clouds of various offerings that descended onto the bodhimaṇḍa Samantāvabhāsana­dharma­megha­nirghoṣa­dhvaja. Clouds of precious parasols covered the entire sky. Clouds of canopies of all flowers were spread above. Clouds of all kinds of food covered and adorned the sky.

source: མཆོད་པའི་སྤྲིན་སྣ་ཚོགས་བརྒྱ་སྟོང་ཕྲག་བཅུ་འཁོར་ལོས་སྒྱུར་བའི་དགེ་བའི་རྩ་བས་ཡོངས་སུ་གྲུབ་པའི་ཆར་པ།
en: Clouds of nets of bells of various jewels adorned the expanse of the sky.

source: སྙིང་པོ་བྱང་ཆུབ་ཀུན་ནས་ལྡང་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་དབྱངས་ཀྱི་རྒྱལ་མཚན་གྱི་འཁོར་ཀུན་ཏུ་མངོན་པར་འབེབས་ཤིང་།
en: The adornment of clouds of light rays of perfume that had been perfumed by an ocean of various perfumes was present throughout the expanse of the sky.

source: རིན་པོ་ཆེའི་གདུགས་ཀྱི་སྤྲིན་གྱི་ནམ་མཁའ་ཀུན་ནས་ཡོག་པར་བྱ་བ་དང་། མེ་ཏོག་ཐམས་ཅད་ཀྱི་བླ་རེའི་སྤྲིན་གྱིས་ནམ་མཁའ་བླ་ནས་ཁེབ་པར་བྱ་བ་དང་། ན་བཟའ་སྣ་ཚོགས་ཀྱི་སྤྲིན་གྱིས་ནམ་མཁའ་ཀུན་ནས་ཡོག་ཅིང་བརྒྱན་པར་བྱ་བ་དང་། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་དྲིལ་བུའི་དྲ་བའི་སྤྲིན་གྱིས་ནམ་མཁའི་དབྱིངས་བརྒྱན་པར་བྱ་བ་དང་། སྤོས་སྣ་ཚོགས་རྒྱ་མཚོས་དྲི་ཞིམ་པར་བྱས་པའི་སྤོས་ཀྱི་འོད་ཟེར་གྱི་སྤྲིན་གྱི་རྒྱན་ནམ་མཁའི་དབྱིངས་ལ་བྱིན་གྱིས་བརླབ་པར་བྱ་བ་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ཁྲི་ལ་རིན་པོ་ཆེའི་གདན་འབེལ་བར་བཏིང་བའི་སྤྲིན་གྱི་རྒྱན་ནམ་མཁའི་དབྱིངས་ལ་བྱིན་ཀྱིས་བརླབ་པ་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་རྒྱལ་མཚན་གྱི་སྤྲིན་མངོན་པར་བསྒྲེང་བའི་རྒྱན་ནམ་མཁའི་དབྱིངས་ལ་བྱིན་གྱིས་བརླབ་པ་དང་། ཁང་པ་དང་གཞལ་མེད་ཁང་ཐམས་ཅད་ཀྱི་སྤྲིན་གྱིས་ཀུན་ནས་ཡོག་པའི་རྒྱན་ནམ་མཁའི་དབྱིངས་ལ་བྱིན་གྱིས་བརླབ་པ་དང་། མེ་ཏོག་སྣ་ཚོགས་ཀྱི་སྤྲིན་གྱིས་ཀུན་ནས་ཡོག་པའི་རྒྱན་ནམ་མཁའི་དབྱིངས་ལ་བྱིན་གྱིས་བརླབ་པ་དང་། མཆོད་པའི་རྒྱན་ཐམས་ཅད་ཀྱི་སྤྲིན་གྱི་ཆར་རབ་ཏུ་འབབ་པའི་རྒྱན་ནམ་མཁའི་དབྱིངས་ལ་བྱིན་གྱིས་བརླབ་པ་བྱེད་ཅིང་།
en: The adornment of clouds of thrones made of all jewels with seats that were precious cushions was present throughout the expanse of the sky. The adornment of clouds of upright banners, made of all jewels, was present throughout the expanse of the sky. The all-covering adornment of clouds of mansions and aerial palaces was present throughout the sky. The all-covering adornment of clouds of various flowers was present throughout the sky. The adornment of rain from clouds of every display of offerings was present throughout the sky.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་རིན་པོ་ཆེའི་འོད་ཀུན་ཏུ་འཕྲོ་བའི་དཔལ་ཡོན་ཏན་དཔལ་གྱི་རྒྱལ་པོ་གང་ན་བ་དེར་སོང་སྟེ།
en: “The king approached the location of the Bhagavat Samanta­jñāna­ratnārci­śrī­guṇa­ketu­rāja.

source: ཕྱིན་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་རིན་པོ་ཆེའི་འོད་ཀུན་ཏུ་འཕྲོ་བའི་དཔལ་ཡོན་ཏན་དཔལ་གྱི་རྒྱལ་པོའི་ཞབས་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Having arrived, he bowed his head to the feet of the Bhagavat Samanta­jñāna­ratnārci­śrī­guṇa­ketu­rāja.

source: བཅོམ་ལྡན་འདས་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས།
en: Then with the Bhagavat to his right, he circumambulated him many hundreds of thousands of times.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་སྟན་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོའི་ཕྱོགས་ཀུན་ཏུ་རྣམ་པར་སྣང་བའི་པདྨོའི་སྙིང་པོ་ཅན་ལ་འདུག་གོ །དེ་ནས་འཁོར་ལོས་སྒྱུར་བའི་བུ་མོ་ཡེ་ཤེས་རིན་པོ་ཆེའི་འོད་ཀུན་ཏུ་འཕྲོ་བའི་པདྨོ་བཟང་མོ་མིག་ཡིད་དུ་འོང་བའི་དཔལ་གྱི་ཟླ་བས་རང་གི་རྒྱན་རྣམས་ལུས་ལས་བཀྲོལ་ཏེ།
en: He then sat before the Bhagavat upon a seat that had as its center a great lotus of precious jewels that shined light into the ten directions. “Then the cakravartin’s daughter, Padma­bhadrābhirāma­netra­śrī­candrā, removed the jewelry from her body and scattered it over the Bhagavat Samanta­jñāna­ratnārci­śrī­guṇa­ketu­rāja.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ཀྱི་འོད་ཀུན་དུ་འཕྲོ་བའི་དཔལ་ཡོན་ཏན་དཔལ་གྱི་རྒྱལ་པོ་ལ་གཏོར་ཏོ་མངོན་པར་གཏོར་ཏོ།
en: “She saw that the jewelry became a great parasol of jewelry made of precious jewels that was situated in the air above the crown of the Bhagavat’s head.

source: །དེ་ནས་རྒྱན་དེ་དག་བཅོམ་ལྡན་འདས་དེའི་དབུའི་གཙུག་གི་སྟེང་གི་བར་སྣང་ལ་ནོར་བུ་རིན་པོ་ཆེའི་རྒྱན་གྱི་གདུགས་ཆེན་པོ་ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་དྲ་བས་ཡོངས་སུ་བསྐོར་བ་ཀླུའི་དབང་པོའི་ལུས་ཀྱིས་གཟུང་བ་རྒྱན་ཐམས་ཅད་ཀྱི་ལུས་ཀྱིས་དབྱིབས་ཤིན་ཏུ་ལེགས་པར་ཀུན་ནས་བསྐོར་བ། རྒྱན་གྱི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་བཅུས་ཡོངས་སུ་བསྐོར་བ།
en: Around its border hung a net of various jewels, it was held by a lord of the nāgas, its round form was composed of all the jewelry, and it was surrounded by a circle of ten parasols made of jewelry.

source: ཤིན་ཏུ་དག་པ་ཁང་པ་བརྩེགས་པའི་དབྱིབས་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ།
en: There was also a beautiful display of a completely pure variety of kūṭāgāras.

source: རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ལྷབ་ལྷུབ་ཀྱི་སྤྲིན་གྱིས་ཀུན་ནས་ཡོག་པ།
en: There was a covering of clouds of every jewel adornment.

source: ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་ཐམས་ཅད་ཀྱི་ཤིང་གི་རྒྱན་གྱིས་ཀུན་ནས་ཁེབས་པ།
en: There was a covering of an array of trees made of all king jewels.

source: ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་སྤོས་ཐམས་ཅད་ཀྱི་རྒྱ་མཚོས་ཡོངས་སུ་བརྒྱན་པར་འདུག་པར་གྱུར་ཏེ།
en: There was the adornment of all the king jewels of an ocean of perfume.

source: དེའི་དབུས་ན་བྱང་ཆུབ་ཀྱི་ཤིང་ཆེན་པོ་ཆོས་ཀྱི་དབྱིངས་ལས་བྱུང་བའི་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ཡལ་ག་དང་། ལྷུན་དུ་ལྡན་པ་ཞེས་བྱ་བ་རྒྱན་བརྗོད་ན་མཐའ་དང་དབུས་མེད་པ་སྐད་ཅིག་རེ་རེ་ཞིང་རྒྱན་སྣ་ཚོགས་ཡོངས་སུ་སྟོན་པ་ཡོད་པ་མཐོང་བར་གྱུར་ཏོ།
en: In their center there was a great Bodhi tree called Dharma­dhātu­prabhava­sarva­ratna­maṇi­śākhā­pralamba. This was a display with no end or center to its description, a variety of displays that were revealed with each instant. “She saw at the foot of that tree the tathāgata named Vairocana.

source: །དེའི་དྲུང་ན་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་ཅེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲེང་བ་སྙེད་ཀུན་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་དུ་བཟང་པོའི་སྤྱོད་པ་དང་། སྨོན་ལམ་གྱིས་བྱུང་བ་བྱང་ཆུབ་སེམས་དཔའི་རྒྱན་སྣ་ཚོགས་ཐ་མི་དད་ཅིང་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་རྣམ་པར་སྤྱོད་པ་ཤ་སྟག་གིས་བསྐོར་ཅིང་མདུན་དུ་བྱས་པ་དང་། འཇིག་རྟེན་གྱི་དབང་པོ་ཐམས་ཅད་ཀྱང་དེ་ལ་མངོན་ཏུ་གྱུར་པ་མཐོང་ངོ་།
en: “She saw bodhisattvas as numerous as the atoms in countless buddha realms, who had all arisen through the completely good bodhisattva conduct and prayer and practiced many countless various different bodhisattva displays surrounding him and in front of him. “She also saw all the lords of the world present there.

source: །བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་དེའི་སངས་རྒྱས་ཀྱིས་རྣམ་པར་འཕྲུལ་པ་མཐའ་དང་དབུས་མེད་པ་ཡང་མཐོང་བར་གྱུར་ཏོ།
en: “She saw the Bhagavat Vairocana’s buddha miracles that were without end or center.

source: །སྔོན་གྱི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་བསྐལ་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ལའང་ཞུགས་པར་གྱུར་ཏོ།
en: “She comprehended his past bodhisattva conduct through a succession of kalpas.

source: །འཇིག་རྟེན་གྱི་ཁམས་དེའི་འདུ་བ་དང་འཇིག་པའི་བསྐལ་པ་ལའང་ཞུགས་པར་གྱུར་ཏོ།
en: She comprehended that world realm’s kalpas of formation and destruction.

source: །འཇིག་རྟེན་གྱི་ཁམས་དེར་འདས་པའི་སངས་རྒྱས་ཀྱི་རྒྱུད་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ལའང་ཞུགས་པར་གྱུར་ཏོ།
en: She comprehended the succession of past buddhas in that world realm.

source: །འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཞབས་ཀྱི་དྲུང་ན་སངས་རྒྱས་མཆོད་པ་ལ་བརྩོན་པར་གནས་པ་ཡང་མཐོང་ངོ་།
en: “She saw the bodhisattva Samanta­bhadra diligently making offerings at the feet of all the tathāgatas.

source: །སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བར་བྱ་བ་ལ་མངོན་དུ་གྱུར་པར་ཡང་མཐོང་ངོ་།
en: She saw his ripening and guiding of all beings.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་ལུས་ལ་གཟུགས་བརྙན་དུ་གྱུར་པར་འཁོད་ཅིང་བདག་ཉིད་ཀྱང་རྗེས་སུ་འབྲང་བར་མཐོང་ངོ་།
en: “She saw all bodhisattvas becoming images within the body of the bodhisattva Samanta­bhadra, and that she herself followed them there.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཞབས་ཀྱི་དྲུང་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་དྲུང་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་གནས་དང་། འཇིག་རྟེན་གྱི་ཁམས་དེ་དང་དེ་དག་ཐམས་ཅད་ནའང་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་གཟུགས་བརྙན་ཀུན་ཏུ་བྱུང་སྟེ།
en: “She saw the image of the bodhisattva Samanta­bhadra appearing everywhere—at the feet of all the tathāgatas, in the dwelling places of all beings, and in every one of the world realms.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་རེ་རེ་ནའང་སངས་རྒྱས་ཀྱི་ཞིང་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་མཚམས་ཀྱི་རྒྱན་དང་བཅས་པ་དང་གཞི་དང་བཅས་པ་དང་། དབྱིབས་དང་བཅས་པ་དང་། ལྷུན་དང་བཅས་པ་དང་། རྒྱན་སྣ་ཚོགས་ཡོངས་སུ་དག་པ་དང་བཅས་པ། རྒྱན་སྣ་ཚོགས་ཀྱི་སྤྲིན་གྱིས་ཀུན་ནས་ཁེབས་པ་རྣམ་པར་བཀོད་པ་དང་། མྱིད་དང་གྲགས་རྣམ་པ་སྣ་ཚོགས་དང་ལྡན་པ་དང་། དེ་བཞིན་གཤེགས་པའི་རྒྱུད་སྣ་ཚོགས་ལས་བརྗོད་པ་དུས་གསུམ་གྱི་ཚུལ་སྣ་ཚོགས་སུ་གཏོགས་པ་དང་། ཕྱོགས་འབྱམ་ཀླས་པ་སྣ་ཚོགས་སུ་འདུ་བ་ཆོས་ཀྱི་དབྱིངས་འབྱམ་ཀླས་པ་སྣ་ཚོགས་ཀྱི་ཁོངས་སུ་གཏོགས་པ། ཆོས་ཀྱི་དབྱིངས་ཀྱི་གཞི་སྣ་ཚོགས་སུ་འདུས་པ། ནམ་མཁའི་དབྱིངས་སྣ་ཚོགས་ལ་རྣམ་པར་གནས་པ། སྙིང་པོ་བྱང་ཆུབ་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ། དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་པ་སྣ་ཚོགས་ཀྱིས་བྱུང་བ་སངས་རྒྱས་ཀྱི་སེང་གེའི་གདན་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ། དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་སྣ་ཚོགས་དང་ལྡན་པ། དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་གྱི་རྒྱུད་སྣ་ཚོགས་ཅན། དེ་བཞིན་གཤེགས་པའི་ཐབས་མཁས་པ་སྣ་ཚོགས་ཡོངས་སུ་བརྗོད་པ་དང་ལྡན་པ། དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་འཁོར་ལོ་འཁོར་བའི་ཚུལ་སྣ་ཚོགས་ཅན་དེ་བཞིན་གཤེགས་པའི་དབྱངས་ཀྱི་ཡན་ལག་དང་། གསུང་གི་ང་རོ་སྣ་ཚོགས་རབ་ཏུ་འབྱུང་བ། སྐད་སྣ་ཚོགས་རྒྱ་མཚོ་ཤིན་ཏུ་བསྟན་པ་དང་ལྡན་པ་དང་། མདོ་སྡེའི་སྤྲིན་སྣ་ཚོགས་རྗེས་སུ་སྒྲོག་པ་ཅན་དག་ཀྱང་མཐོང་བར་གྱུར་ཏོ།
en: “She saw that in each of those world realms there were as many worlds as there are atoms in a buddha realm, with the extent of their arrays and with their foundations, their shapes, their forms, their various pure arrays, their being covered by clouds of various displays, their various names and numbers, the descriptions of their various buddha lineages and their various appearances within the three times, their pervasion throughout the extent of the directions, their various presences throughout the extent of the realm of phenomena, their appearance within the various areas of the realm of phenomena, their various locations within areas in space, their displays of various bodhimaṇḍas, the arising of the various miracles of the tathāgatas, the display of the various lion thrones of the buddhas, the various oceans of the assemblies of followers of the tathāgatas, the various activities of the followers of the tathāgatas, the revelation of the skillful methods of the tathāgatas, the various ways of the turning of the Dharma wheels of the tathāgatas, the arising of the various aspects of speech and the sound of the voices of the tathāgatas, the teaching through an ocean of various languages, and the roar of clouds of various sūtras.

source: །མཐོང་ནས་དེ་བས་ཀྱང་དགའ་བ་དང་། མོས་པའི་ཤུགས་ཆེན་པོ་ཐོབ་པར་གྱུར་ཏེ། དེ་དེ་ལྟར་དགའ་བའི་ཤུགས་ཆེན་པོ་སྐྱེས་པར་གྱུར་བ་ལ། བཅོམ་ལྡན་འདས་ཡེ་ཤེས་རིན་པོ་ཆེའི་འོད་ཀུན་ཏུ་འཕྲོ་བའི་དཔལ་ཡོན་ཏན་དཔལ་གྱི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་དེས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྒྲགས་པ་ཞེས་བྱ་བའི་མདོ་སྡེ་འཁོར་གྱི་མདོ་སྡེ། སངས་རྒྱས་ཀྱི་ཞིང་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་བཅས་པ་ཡང་དག་པར་བསྟན་ཏེ།
en: “When she saw that, she attained a powerful happiness and delight. After she had given rise to powerful happiness, that tathāgata, the Bhagavat Samanta­jñāna­ratnārci­śrī­guṇa­ketu­rāja, taught the sūtra called The Resounding of the Dharma Wheels of All the Tathāgatas and as many accompanying sūtras as there are atoms in ten buddha realms.

source: དེས་མདོ་སྡེ་དེ་ཐོས་པར་གྱུར་ནས། ཏིང་ངེ་འཛིན་གྱི་སྒོ་སྟོང་ཕྲག་བཅུ་ཤིན་ཏུ་ཕྲ་ཞིང་རེག་ན་བདེ་བར་ཐོབ་པར་གྱུར་ཏེ།
en: When she heard that sūtra, she attained the bliss of reaching ten thousand subtle gateways to samādhi.
